package entity

type Type []string

// 有or無
var Available Type = []string{
	"あり",
	"なし",
}

// 不問or不可
var NotAsk Type = []string{
	"不問",
	"不可",
}

// 条件あり（詳細参照）,不可
// 条件ありor不可
var ConditionOrNot Type = []string{
	"条件あり（備考参照）",
	"不可",
	// index = 99 不問
}

// 利用可能or利用不可
var UsageStatus Type = []string{
	"利用可能",
	"利用不可",
}

// 中途or新卒or既卒orフリーター
var UserStatus Type = []string{
	"中途",
	"新卒",
	"既卒orフリーター",
}

var EmploymentStatus Type = []string{
	"正社員",
	"契約社員",
	"派遣社員",
	"紹介予定派遣",
	"アルバイト・パート",
	"自営業",
	"業務委託",
	// index = 99 不問
}

// 業界 (2023/11/01更新)
// https://system.slack.com/archives/C04MGLZSH8Q/p1695795981546999?thread_ts=1695782675.478629&cid=C04MGLZSH8Q
var Industry map[string]map[uint]string = map[string]map[uint]string{
	"IT": {
		100: "IT",
		101: "通信キャリア",
	},
	"メーカー": {
		200: "メーカー（資源・化学・素材）",
		201: "メーカー（鉄鋼・金属）",
		202: "メーカー（自動車・機械）",
		203: "メーカー（電機・電子・半導体）",
		204: "メーカー（医薬・医療）",
		205: "メーカー（部品）",
		206: "メーカー（飲食品）",
		207: "メーカー（衣類）",
		208: "メーカー（住宅・建材）",
		209: "メーカー（生活用品）",
		210: "メーカー（その他）",
	},
	"総合商社": {
		300: "総合商社",
	},
	"専門商社": {
		400: "専門商社（資源・化学・素材）",
		401: "専門商社（鉄鋼・金属）",
		402: "専門商社（自動車・機械）",
		403: "専門商社（電機・電子・半導体）",
		404: "専門商社（医薬・医療）",
		405: "専門商社（部品）",
		406: "専門商社（飲食品）",
		407: "専門商社（衣類）",
		408: "専門商社（住宅・建材）",
		409: "専門商社（生活用品）",
		410: "専門商社（その他）",
	},
	"教育・人材": {
		500: "人材ビジネス",
		501: "技術者派遣・アウトソーサー",
		502: "教育ビジネス",
	},
	"流通・小売": {
		600: "流通・小売（店舗）",
		601: "流通・小売（通信・ネット）",
	},
	"インターネット・メディア・広告": {
		700: "メディア（放送・出版・印刷）",
		701: "メディア（Web）",
		702: "セールスプロモーション（イベント）",
		703: "広告（雑誌・新聞・交通・屋外）",
		704: "広告（Web）",
		705: "Webマーケティング",
		706: "Web制作・デザイン",
		707: "ゲーム",
	},
	"コンサルティング・M&A": {
		800: "コンサルティング・シンクタンク",
		801: "M&A・事業継承",
	},
	"業務支援": {
		900: "BPO・コールセンター",
		901: "営業支援・ビジネスマッチング",
		902: "リサーチ",
	},
	"士業": {
		1000: "法律・会計・税務・特許・労務",
	},
	"金融・保険": {
		1100: "金融",
		1101: "保険",
		1102: "証券",
	},
	"メディカル": {
		1200: "医療",
		1201: "福祉・介護",
	},
	"サービス": {
		1300: "旅行・宿泊",
		1301: "理容・美容",
		1302: "外食・飲食",
		1303: "娯楽・レジャー",
		1304: "リユース・リサイクル・買取",
		1305: "冠婚葬祭",
		1306: "警備・清掃",
		1307: "サービス（その他）",
	},
	"建設・不動産": {
		1400: "不動産",
		1401: "建設・土木",
	},
	"物流・運輸": {
		1500: "物流・倉庫",
		1501: "陸運・海運・航空・鉄道",
	},
	"インフラ": {
		1600: "電気・ガス・エネルギー・水道",
	},
	"その他": {
		1700: "保育・学校",
		1701: "農林・水産・畜産",
		1702: "団体・連合会・官公庁",
		1703: "その他の業種",
	},
}

// 職種 (2023/11/01更新)
// https://system.slack.com/archives/C04MGLZSH8Q/p1695795981546999?thread_ts=1695782675.478629&cid=C04MGLZSH8Q
var Occupation map[string]map[uint]string = map[string]map[uint]string{
	"エグゼクティブ系": {
		100: "役員・経営幹部",
	},
	"営業": {
		200: "法人営業",
		201: "個人営業",
		202: "技術営業",
		203: "海外営業",
		204: "営業（その他）",
	},
	"コンサルタント": {
		300: "戦略コンサルタント",
		301: "財務・会計コンサルタント",
		302: "ITコンサルタント",
		303: "その他コンサルタント",
	},
	"接客・販売・サービス系": {
		400: "接客",
		401: "販売",
		402: "カスタマサポート",
		403: "テレマーケティング",
		404: "サービス職（警備・清掃・監視）",
		405: "サービス職（物流・配送・ドライバー）",
		406: "サービス職（調理・宿泊）",
		407: "サービス職（美容）",
		408: "サービス職（小売・SV・MD）",
		409: "カスタマーサクセス",
	},
	"企画系": {
		500: "経営企画・事業企画",
		501: "営業企画・商品企画・販促企画",
		502: "マーケティング",
		503: "購買・貿易",
		504: "プロジェクトマネージャー",
		505: "プロダクトマネージャー",
	},
	"物流系": {
		600: "物流管理",
	},
	"クリエイティブ系": {
		700: "プランナー",
		701: "プロデューサー・ディレクター",
		702: "デザイナー",
		703: "クリエイター",
		704: "ライター",
		705: "制作・進行管理",
	},
	"バックオフィス系": {
		800: "経理・財務・会計",
		801: "総務・人事",
		802: "法務・知財",
		803: "広報・IR",
	},
	"士師業": {
		900: "士業（会計・監査）",
		901: "士業（法律・労務）",
		902: "師業（医療・看護）",
		903: "師業（薬剤）",
	},
	"事務系": {
		1000: "一般事務・●●事務",
		1001: "受付",
		1002: "秘書",
	},
	"技術系": {
		1100: "ITエンジニア（設計）",
		1101: "ITエンジニア（開発）",
		1102: "ITエンジニア（インフラ）",
		1103: "ITエンジニア（サポート）",
		1104: "ITエンジニア（社内）",
		1105: "技術職（設計）",
		1106: "技術職（研究）",
		1107: "技術職（開発）",
		1108: "技術職（製造）",
		1109: "技術職（品質保証・管理）",
		1110: "技術職（建築・インフラ・施工管理）",
		1111: "技術職（整備・点検）",
		1112: "技術職（その他）",
	},
	"専門職系": {
		1200: "データアナリスト",
		1201: "データサイエンティスト",
		1202: "リサーチャー",
		1203: "専門職（金融）",
		1204: "専門職（介護・福祉）",
		1205: "専門職（スポーツ）",
		1206: "専門職（医療）",
		1207: "専門職（教育・保育）",
		1208: "不動産・プロパティマネジメント系専門職",
		1209: "インストラクター・通訳・翻訳",
	},
	"公務員・農林水産": {
		1300: "公務員",
		1301: "教師・教員・講師",
		1302: "農林水産関係職",
	},
	"その他": {
		1400: "その他",
		1401: "芸能",
	},
}

// 都道府県
var Prefecture Type = []string{
	"北海道",
	"青森県",
	"岩手県",
	"宮城県",
	"秋田県",
	"山形県",
	"福島県",
	"茨城県",
	"栃木県",
	"群馬県",
	"埼玉県",
	"千葉県",
	"東京都",
	"神奈川県",
	"新潟県",
	"富山県",
	"石川県",
	"福井県",
	"山梨県",
	"長野県",
	"岐阜県",
	"静岡県",
	"愛知県",
	"三重県",
	"滋賀県",
	"京都府",
	"大阪府",
	"兵庫県",
	"奈良県",
	"和歌山県",
	"鳥取県",
	"島根県",
	"岡山県",
	"広島県",
	"山口県",
	"徳島県",
	"香川県",
	"愛媛県",
	"高知県",
	"福岡県",
	"佐賀県",
	"長崎県",
	"熊本県",
	"大分県",
	"宮崎県",
	"鹿児島県",
	"沖縄県",
	"海外",
	// index = 1000 "全国各地",
}

var HolidayForJobSeeker = map[uint]string{
	0:  "完全週休2日制（土日）",
	1:  "完全週休2日制（土日以外）",
	2:  "週休2日制（イレギュラー出勤有）",
	3:  "シフト制",
	4:  "●勤●休制",
	5:  "●週●休制",
	99: "不問",
}

var HolidayForJobInfo = map[uint]string{
	0:  "完全週休2日制（土日）",
	1:  "完全週休2日制（土日以外）",
	2:  "週休2日制（イレギュラー出勤有）",
	3:  "シフト制",
	4:  "●勤●休制",
	5:  "●週●休制",
	99: "その他 / 会社カレンダーによる",
}

var CompanyScale Type = []string{
	"10名未満",
	"10名以上100名未満",
	"100名以上500名未満",
	"500名以上1000名未満",
	"1000名以上",
	// index=99 "不問",
}

// プライム,スタンダード,グロース,非上場,上場準備
var PublicOffering Type = []string{
	"プライム",
	"スタンダード",
	"グロース",
	"非上場",
	"上場準備",
	"その他株式市場上場",
}

var Position Type = []string{
	"一般",
	"主任",
	"係長",
	"課長",
	"次長",
	"部長",
	"事業部長",
	"取締役常務",
	"取締役専務",
	"副社長",
	"社長",
	"会長",
}

// 特徴
var JobFeature Type = []string{
	"業界未経験OK",
	"職種未経験OK",
	"業界・職種未経験OK",
	"正社員経歴なしOK",
	"学歴不問",
	"産休・育休実績有り",
	"転勤なし",
	"大手・上場企業",
	"中堅中小",
	"ベンチャー",
	"フレックス",
	"リモート可",
	"副業可",
	"WEB面接可",
	"語学を活かせる",
	"福利厚生充実",
	"研修充実",
	"女性活躍中",
	"シェアトップクラス",
	"社員寮あり",
	"年間休日120日以上",
	"残業時間20時間以内",
	"外国籍可",
}

// 即入社可能,1ヶ月以内,2ヶ月以内,3ヶ月以内,4ヶ月以内,5ヶ月以内,6ヶ月以内,7ヶ月〜
var JoinCompanyPeriod Type = []string{
	"即入社可能",
	"1ヶ月以内",
	"2ヶ月以内",
	"3ヶ月以内",
	"4ヶ月以内",
	"5ヶ月以内",
	"6ヶ月以内",
	"7ヶ月〜",
}

var ContractPhase Type = []string{
	"リーガルチェック中",
	"リーガルチェック完了",
	"契約締結済み",
}

var LanguageType Type = []string{
	"英語",
	"ドイツ語",
	"フランス語",
	"スペイン語",
	"ポルトガル語",
	"イタリア語",
	"中国語（北京語）",
	"中国語（江東語）",
	"韓国語",
	"ロシア語",
	"マレーシア語",
	"ベトナム語",
	"タイ語",
	"日本語",
	"トルコ語",
	"インドネシア語",
	"アラビア語",
}

var LanguageLevel Type = []string{
	"ビジネス",
	"日常会話",
}

// 廃止
// var TalkingSkill Type = []string{
// 	"学校で学び、ある程度抵抗が無い",
// 	"流暢ではないが、ある程度の日常会話ができる",
// 	"打ち合わせや交渉ができる",
// }

// var ReadingSkill Type = []string{
// 	"学校で学び、ある程度抵抗が無い",
// 	"辞書を用いて文章が理解できる",
// 	"資料・報告書などの読解には支障が無い",
// }

// var WritingSkill Type = []string{
// 	"学校で学び、ある程度抵抗が無い",
// 	"辞書を用いて報告書やレターを正しく書ける",
// 	"報告書やレターを正しく書ける",
// }

// PCスキル
// var PCSkillCategory Type = []string{
// "Excelスキル",
// "Accessスキル", = 廃止
// "Wordスキル",
// "PowerPointスキル",
// "その他PCスキル", = 廃止
// }

// var PCSkillTypeList []Type = []Type{
// PCSkillTypeExcel,
// PCSkillTypeAccess, = 廃止
// PCSkillTypeWord,
// PCSkillTypePowerPoint,
// PCSkillTypeOther, = 廃止
// }

var ExcelSkill Type = []string{
	"初級（利用できる）",
	"中級（VLOOKUP・IF関数など）",
	"上級（マクロ・関数組み合わせ・業務改善など）",
	// 不問　= 99
}

var WordSkill Type = []string{
	"初級（利用できる）",
	"中級（社内資料作成など）",
	"上級（対外的な重要資料作成など）",
	// 不問　= 99
}

var PowerPointSkill Type = []string{
	"初級（利用できる）",
	"中級（社内資料作成など）",
	"上級（対外的な重要資料作成など）",
	// 不問　= 99
}

var PCTool Type = []string{
	"Adobe",
	"Photoshop",
	"Illustrator",
	"Dreamweaver",
	"Homepagebuilder",
	"Flash",
	"Fireworks",
	"QuarkXPress",
	"InDesign",
	"勘定奉行",
	"弥生会計",
	"給与関連ソフト",
	"PCA会計",
	"SAP",
	"Access",
	// "その他会計ソフト", = 99
	// 不問　= 1000
}

// 開発スキル
var DevelopmentCategory Type = []string{
	"開発言語",
	"開発OS",
}

var DevelopmentTypeList []Type = []Type{
	DevelopmentTypeLanguage,
	DevelopmentTypeOS,
}

// 開発言語
var DevelopmentTypeLanguage Type = []string{
	"ABAP",
	"ActionScript",
	"Ajax",
	"ASP",
	"ASP.NET",
	"BAT",
	"C",
	"C#",
	"C++",
	"COBOL",
	"Cocos2d-X",
	"CSS",
	"Delphi",
	"F#",
	"Go",
	"HTML",
	"HTML5",
	"Java",
	"JavaScript",
	".NET",
	"Objective-C",
	"Perl",
	"PHP",
	"PL/1",
	"PL/SQL",
	"Python",
	"R",
	"RPG",
	"Ruby",
	"Shell",
	"SQL",
	"Swift",
	"TypeScript",
	"Unity",
	"VB",
	"VBA",
	"VB.NET",
	"VC・VC++",
}

// Linux系,Mac,Windows系,UNIX系,汎用機,組み込み系,iOS,Android,Firefox
var DevelopmentTypeOS Type = []string{
	"Linux系",
	"Mac",
	"Windows系",
	"UNIX系",
	"汎用機",
	"組み込み系",
	"iOS",
	"Android",
	"Firefox",
}

var Accuracy = []string{
	"内定承諾",
	"Aヨミ",
	"Bヨミ",
	"Cヨミ",
	"ネタ",
	"失注",
}

// 経験年数（LPで入力）
var ExperienceYear = map[uint]string{
	0: "1年未満",
	1: "1年以上",
	2: "2年以上",
	3: "3年以上",
	4: "4年以上",
	5: "5年以上",
}

// 従業員数（LPで入力）
var EmployeeNumber = map[uint]string{
	0: "10人未満",      // 5で登録
	1: "10〜49人",     // 10で登録
	2: "50〜99人",     // 50で登録
	3: "100〜299人",   // 100で登録
	4: "300〜999人",   // 300で登録
	5: "1000〜2999人", // 1000で登録
	6: "3000〜4999人", // 3000で登録
	7: "5000人以上",    // 5000で登録
}
