package entity

var TaskPhaseSubEntry = map[uint]string{
	0:    "マスクレジュメ打診の依頼",
	1:    "マスクレジュメ社内NG",
	2:    "マスクレジュメの結果回収中",
	3:    "マスクレジュメ不合格",
	4:    "求人打診の依頼",
	5:    "応募意思確認中",
	6:    "応諾にならず終了", // 打診フェーズになる
	7:    "エントリー辞退",
	8:    "エントリー保留",
	9:    "求職者シェア依頼",
	10:   "打診せず終了",
	11:   "求人シェア依頼",
	12:   "企業に合格可能性を確認中",
	13:   "合格可能性が低いためNG",
	90:   "合格可能性が低いためNG終了",
	91:   "打診せず終了",
	92:   "エントリー辞退終了",
	98:   "辞退終了",
	99:   "終了",
	100:  "辞退依頼",
	101:  "辞退引き止め依頼",
	102:  "求職者確認中",
	1000: "辞退処理前のフェーズ",
}

var TaskPhaseSubDocument = map[uint]string{
	0:    "書類推薦依頼",
	1:    "結果回収中",
	2:    "不合格通知",
	3:    "エントリー依頼",
	4:    "応募書類準備",
	5:    "応募辞退",
	90:   "エントリー辞退終了",
	91:   "不合格終了",
	98:   "辞退終了",
	99:   "終了",
	100:  "辞退依頼",
	101:  "辞退引き止め依頼",
	102:  "求職者確認中",
	1000: "辞退処理前のフェーズ",
}

var TaskPhaseSubSelection = map[uint]string{
	0:    "候補日回収依頼",
	1:    "候補日回収中",
	2:    "日程調整依頼",
	3:    "日程調整中", // 企業
	4:    "日程案内依頼",
	5:    "日程確認中", // 求職者
	6:    "日程確定",
	7:    "前日確認依頼",
	8:    "案内依頼",
	9:    "選考所感の回収",
	10:   "選考結果の回収依頼",
	11:   "求職者対応中",
	12:   "不合格通知",
	13:   "詳細案内依頼",
	14:   "日程・詳細案内依頼",
	15:   "日程・詳細確認中",
	16:   "日程確定（詳細案内済み）",
	17:   "終了通知",
	18:   "辞退処理依頼",
	90:   "不合格終了",
	97:   "中断終了",
	98:   "辞退終了",
	99:   "終了",
	100:  "辞退依頼",
	101:  "辞退引き止め依頼",
	102:  "求職者確認中",
	1000: "辞退処理前のフェーズ",
	103:  "キャンセル・リスケ依頼",  // CAタスク
	104:  "キャンセル・リスケ確認中", // CAタスク
	105:  "キャンセル・リスケ",
	106:  "キャンセル・リスケ依頼",  // RAタスク
	107:  "キャンセル・リスケ確認中", // RAタスク
	999:  "選考スキップ",
}

var TaskPhaseSubFinal = map[uint]string{
	0:    "候補日回収依頼",
	1:    "候補日回収中",
	2:    "日程調整依頼",
	3:    "日程調整中",
	4:    "日程案内依頼",
	5:    "日程確認中", // 求職者
	6:    "日程確定",
	7:    "前日確認依頼",
	8:    "案内依頼",
	9:    "選考所感の回収",
	10:   "選考結果の回収依頼",
	11:   "求職者対応中",
	12:   "不合格通知",
	13:   "詳細案内依頼",
	14:   "日程・詳細案内依頼",
	15:   "日程・詳細確認中",
	16:   "日程確定（詳細案内済み）",
	17:   "終了通知",
	18:   "辞退処理依頼",
	90:   "不合格終了",
	97:   "中断終了",
	98:   "辞退終了",
	99:   "終了",
	100:  "辞退依頼",
	101:  "辞退引き止め依頼",
	102:  "求職者確認中",
	1000: "辞退処理前のフェーズ",
	103:  "キャンセル・リスケ依頼",  // CAタスク
	104:  "キャンセル・リスケ確認中", // CAタスク
	105:  "キャンセル・リスケ",
	106:  "キャンセル・リスケ依頼",  // RAタスク
	107:  "キャンセル・リスケ確認中", // RAタスク
	999:  "選考スキップ",       // CAタスク
}

var TaskPhaseSubConfirm = map[uint]string{
	0:   "内定通知依頼",
	1:   "承諾意思の確認",
	2:   "オファー面談の候補日回収依頼",
	3:   "オファー面談の日程回収中",
	4:   "オファー面談の日程調整依頼",
	5:   "オファー面談の日程調整中",
	6:   "オファー面談の日程確認依頼",
	7:   "オファー面談の日程・詳細確認中",
	8:   "オファー面談の日程確定",
	9:   "オファー面談の詳細案内依頼",
	10:  "情報回収依頼",
	11:  "情報回収中",
	12:  "内定辞退",
	90:  "内定辞退終了",
	98:  "辞退終了",
	99:  "終了",
	103: "キャンセル・リスケ依頼",  // CAタスク
	104: "キャンセル・リスケ確認中", // CAタスク
	105: "キャンセル・リスケ",
	106: "キャンセル・リスケ依頼",  // RAタスク
	107: "キャンセル・リスケ確認中", // RAタスク

}

var TaskPhaseSubAcceptJobOffer = map[uint]string{
	0:  "内定承諾",
	1:  "入社フォロー",
	2:  "入社可能日の確認依頼",
	3:  "入社可能日の確認中",
	4:  "入社日調整依頼",
	5:  "案内依頼",
	6:  "求職者確認中",
	7:  "対応依頼",
	8:  "対応中",
	9:  "入社確認",
	10: "入社確認依頼",
	11: "請求書発行",
	99: "決定終了",
	// 99: "終了",
	100: "辞退依頼",
	101: "辞退引き止め依頼",
	102: "求職者確認中",
}

var TaskPhaseSubIssuevoice = map[uint]string{
	0:  "発行申請",
	1:  "発行決済",
	2:  "請求書発行",
	3:  "入金確認依頼",
	4:  "支払状況確認依頼",
	5:  "支払状況確認中",
	6:  "報告",
	7:  "入金完了",
	99: "終了",
}

var TaskPhaseSubIssueRefund = map[uint]string{
	0:  "辞退依頼",
	1:  "辞退引き止め依頼",
	2:  "求職者確認中",
	3:  "キャンセル・リスケ依頼",
	4:  "キャンセル・リスケ確認中",
	5:  "キャンセル・リスケ",
	6:  "キャンセル・リスケ依頼",
	7:  "キャンセル・リスケ確認中",
	99: "終了",
}

var TaskPhaseSubDecline = map[uint]string{
	0:  "状況確認依頼",
	1:  "状況確認中",
	2:  "状況確認依頼",
	3:  "状況確認",
	4:  "状況確認完了",
	5:  "報告確認依頼",
	6:  "請求書回収依頼",
	7:  "請求書支払依頼",
	8:  "支払完了",
	99: "終了",
}

var TaskPhase = map[uint]string{
	0:  "エントリー",
	1:  "書類選考",
	2:  "1次選考",
	3:  "2次選考",
	4:  "3次選考",
	5:  "4次選考",
	6:  "5次選考",
	7:  "最終選考",
	8:  "内定保留",
	9:  "内定承諾",
	10: "請求書発行",
	11: "返金",
	99: "辞退",
}

var TaskPhaseSub = map[uint]map[uint]string{
	0:  TaskPhaseSubEntry,
	1:  TaskPhaseSubDocument,
	2:  TaskPhaseSubSelection,
	3:  TaskPhaseSubSelection,
	4:  TaskPhaseSubSelection,
	5:  TaskPhaseSubSelection,
	6:  TaskPhaseSubSelection,
	7:  TaskPhaseSubFinal,
	8:  TaskPhaseSubConfirm,
	9:  TaskPhaseSubAcceptJobOffer,
	10: TaskPhaseSubIssuevoice,
	11: TaskPhaseSubIssueRefund,
	99: TaskPhaseSubDecline,
}
